
"""
Дано символи s1, s2, .... Відомо, що символ s1 відмінний від пробілу і що серед s2,
s3, ... є хоча б один пробіл. Розглядаються s1, ..., sn - символи, що передують першому
пробілу (n заздалегідь не відомо). Перетворити послідовність s1, ..., sn, видаливши з неї
всі символи, які не є буквами.
"""

answer = '1'
while answer == '1':

    s = []
    print("Введіть довільну послідовність символів (натисніть пробіл, щоб завершити введення):")
    while True:
        n = input()
        if n == ' ':
            if s == []:
                print("Перший символ не може бути пробілом!")
                continue
            break
        else:
            for i in n:
                s.append(i)

    for i in range(len(s)):
        if not s[i].isalpha():
            s[i] = 0
    for i in range(s.count(0)):
        s.remove(0)

    print("Введена послідовність, з якої видалено всі символи, що не є буквами:", s)

    answer = input("Введіть '1' для повторення:")

# Виконав Іваненко Андрій Вадимович
